using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class PropConfig : MonoBehaviour
{
   public enum PropType
   {
      None,
      WeaponFragment,
      JingCui,
      ShenHuaCaiLiao,
      ChiBang,
      LingHun,
      HH,
      HA,
      HC,
      HD,
      AA,
      AC,
      AD,
      CC,
      CD,
      DD,
   }

   public static Dictionary<int, string> PropNameDic = new Dictionary<int, string>()
   {
      { 101,"普通武器碎片"},
      { 102,"优秀武器碎片"},
      { 103,"精良武器碎片"},
      { 104,"史诗武器碎片"},
      { 105,"传说武器碎片"},
      { 106,"神话武器碎片"},
      
      { 201,"普通精粹"},
      { 202,"优秀精粹"},
      { 203,"精良精粹"},
      { 204,"史诗精粹"},
      { 205,"传说精粹"},
      { 206,"神话精粹"},
      
      { 301,"附魔之骨"},
      { 302,"黄金之血"},
      { 303,"巨大牙齿"},
      { 304,"罪恶眼珠"},
      { 305,"神话之心"},
      
      { 401,"普通羽毛"},
      { 402,"优秀羽毛"},
      { 403,"精良羽毛"},
      { 404,"史诗羽毛"},
      { 405,"传说羽毛"},
      { 406,"神话羽毛"},
   };


   public static Dictionary<int, string> PropDescDic = new Dictionary<int, string>()
   {
      {101,"普通武器破碎而成，可用于解锁初级武器" },
      {102,"带有一丝灵性的碎片，可以用来解锁武器"},
      {103,"难得一见的碎片，可解锁高级武器" },
      {104,"远古战场遗留，可用于解锁史诗武器" },
      {105,"传说中神器的碎片，或许可以拼凑出远古的神器！" },
      {106,"混沌中诞生，武器的终极！" },
      
      {201,"普通精粹，基础材料，用于初阶进阶" },
      {202,"蕴含微弱能量的精粹，可提升装备潜能" },
      {203,"纯度较高的精粹，可触发高级进阶" },
      {204,"远古残晶，能解锁史诗级潜能" },
      {205,"传说之精粹，或可唤醒古老力量" },
      {206,"创生与毁灭凝聚，进阶的终极芯核" },
      
      {301,"充满纹路的传说之骨，用于神话合成" },
      {302,"金黄色血液，用于神话合成" },
      {303,"传说生物的牙齿，用于神话合成" },
      {304,"恶魔的眼珠，用于神话合成" },
      {305,"诞生于创生与毁灭之间，用于进阶的终极材料！" },


      {401,"普通家禽羽毛，轻盈可作装饰" },
      {402,"精致羽毛，能稍增飞行与灵活" },
      {403,"稀有羽毛，强化翅膀增强战力" },
      {404,"战羽遗留，蕴含着磅礴之力" },
      {405,"传说羽翎，承载远古飞兽的力量印记" },
      {406,"羽端汇星辰，跨界之羽，进阶的终极之选" },
   };
}
